[
  {
    "date": "Mar 2021 - Present",
    "position": "Manager - Divisi Application Development, Architecture & Governance",
    "organization": "PT Bank Raya Indonesia",
    "description": "Build applications for the Android and iOS platforms using Flutter. Collaborate with cross-functional teams to define, design, and ship new features. Work on bug fixing and improving application performance. Continuously discover, evaluate, and implement new technologies to maximize development efficiency. Write clean and readable code. Make use of App Architecture, Design patterns and advanced Git in order to produce highly maintainable code."
  },
  {
    "date": "2020 - 2021",
    "position": "Web and Application Developer",
    "organization": "PT Tradecorp Indonesia",
    "description": "Create SEO friendly websites conforming SEO best practices and develop mobile applications from ideation until completion."
  },
  {
    "date": "2020",
    "position": "Senior Mobile Engineer",
    "organization": "Loadsmile - Digital Services Australia IV Pty Ltd",
    "description": "Design and build advanced applications for the Android and iOS platforms using Flutter. Collaborate with cross-functional teams to define, design, and ship new features. Unit-test code for robustness, including edge cases, usability, and general reliability using techniques like TDD. Work on bug fixing and improving application performance. Continuously discover, evaluate, and implement new technologies to maximize development efficiency. Write clean and readable code. Make use of DDD, Design patterns and advanced Git in order to produce highly maintainable code."
  },
  {
    "date": "2019",
    "position": "Senior Software Engineer",
    "organization": "Sprout - PT Tunas Digital Indonesia",
    "description": "Create, maintain, and implement the source code to develop web / mobile apps/programs that meet the needs and requirements of the clients using Agile principles with the Scrum framework."
  },
  {
    "date": "2018",
    "position": "COO",
    "organization": "PT Gaji Cermat Indonesia",
    "description": "Overseeing the company's day-to-day operations, daily communication with the CEO, creating operations strategies and policies, communicating operational strategies to employees, building employee alignment with company goals (and vice versa), and overseeing human resources development."
  },
  {
    "date": "2018",
    "position": "iOS Developer",
    "organization": "Apple Developer Academy",
    "description": "Solving challenges from communities using collaborative approach."
  },
  {
    "date": "2008 - Present",
    "position": "Web & Mobile Developer",
    "organization": "JH Soft",
    "description": "Designing, implementing, and modifying websites or mobile apps, from layout to function and according to a client's specifications. Strive to create visually appealing sites that feature user-friendly design and clear navigation."
  }
]
